moiify/M26-DTU/stm32f030x8/projects/stm32f10x_std/Source/FML/gprs/gprs_process.c
            GPRS_WriteBytes("AT+CGREG?\r\n");
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CGREG_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CGREG,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_CGREG_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD CGREG timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_CGREG_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CGREG_Req;
                }
            }
            break;
        }
        case GPRSState_CGATT_Req:
        {
            GPRS_WriteBytes("AT+CGATT?\r\n");
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CGATT_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CREG,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }        
        case GPRSState_CGATT_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD CREG timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_CREG_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CGATT_Req;
                }
            }
            break;
        }        
        case GPRSState_QIMUX_Req:
        {
            GPRS_WriteBytes("AT+QIMUX=1\r\n");
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIMUX_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIMUX,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIMUX_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QIMUX timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QIMUX_Req;
                }
            }
            break;
        }
        case GPRSState_QIMUXE_Req:
        {   
            
            GPRS_WriteBytes("AT+QIMUX?\r\n");
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIMUXE_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIMUXE,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIMUXE_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {            
                DEBUG("[GPRS] CMD QIMUXE timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QIMUXE_Req;
                }
            }
            break;
        }
        case GPRSState_QIDNSIP_Req:
        {   
            if(s_GPRS_CB.cur_socket_info.Conncet_way==IP_Connect)
            {
                GPRS_WriteBytes("AT+QIDNSIP=0\r\n");
            }
            else if(s_GPRS_CB.cur_socket_info.Conncet_way==Domain_Connect)
            {
                GPRS_WriteBytes("AT+QIDNSIP=1\r\n");
            }
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIDNSIP_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIDNSIP,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIDNSIP_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QIDNSIP timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QIDNSIP_Req;
                }
            }
            break;
        }
        case GPRSState_QIOPEN_Req:
        {
            if(s_GPRS_CB.cur_socket_info.Conncet_way==IP_Connect)
            {
                 sprintf(send_buf,"AT+QIOPEN=%d,\"TCP\",\"%s\",\"%d\"\r\n",s_GPRS_CB.cur_socket_info.Mux,s_GPRS_CB.cur_socket_info.IP_Address,s_GPRS_CB.cur_socket_info.Server_port);
                 GPRS_WriteBytes((uint8_t *)send_buf);
            }
            else if(s_GPRS_CB.cur_socket_info.Conncet_way==Domain_Connect)
            {
                 sprintf(send_buf,"AT+QIOPEN=%d,\"TCP\",\"%s\",\"%d\"\r\n",s_GPRS_CB.cur_socket_info.Mux,s_GPRS_CB.cur_socket_info.Domain,s_GPRS_CB.cur_socket_info.Server_port);
                 GPRS_WriteBytes((uint8_t *)send_buf);
            }
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIOPEN_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIOPEN,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIOPEN_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                    s_GPRS_CB.cur_socket_open_failed_count++;
                    if(s_GPRS_CB.cur_socket_open_failed_count==3)
                    {   
                        s_GPRS_CB.cur_socket_open_failed_count=0;
                        s_GPRS_CB.socketline_state=SocketState_Idle;
                    }
                    
                    else
                    {
                        gprs_add_state(GPRSState_QICLOSE_Req);
                        gprs_add_state(GPRSState_QIDNSIP_Req);
                    }
                    s_GPRS_CB.retry_count=0;
                    s_GPRS_CB.state = GPRSState_Idle;
            }
            break;
        }
        case GPRSState_QICLOSE_Req:
        {   
            sprintf(send_buf,"AT+QICLOSE=%d\r\n",s_GPRS_CB.cur_socket_info.Mux);
            GPRS_WriteBytes((uint8_t *)send_buf);
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QICLOSE_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QICLOSE,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        } 
        case GPRSState_QICLOSE_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QICLOSE timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_Idle;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QICLOSE_Req;
                }
          }
            break;
        }
        case GPRSState_QISEND_Req:
        {
            sprintf(send_buf,"AT+QISEND=%d,%d\r\n",g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux,g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Len);
             GPRS_WriteBytes((uint8_t *)send_buf);
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QISEND_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:%s\r\n",send_buf);
            break;
        }
        case GPRSState_QISEND_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {   
                s_GPRS_CB.Socket_Info_t[g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux].LinkState=GPRSLinkState_Lost;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.extra_request=GPRS_None_Req;
                s_GPRS_CB.retry_count=0;
            }
            break;
        }
        case GPRSState_QISEND_Data_Req:
        {
            sprintf(send_buf,"%s",g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Buf); 
            GPRS_WriteBytes((uint8_t *)send_buf);
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QISEND_Data_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:%s\r\n",send_buf);
            break;
        }
        case GPRSState_QISEND_Data_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD SendData timeout\r\n");
                s_GPRS_CB.Socket_Info_t[g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux].LinkState=GPRSLinkState_Lost;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.extra_request=GPRS_None_Req;
                s_GPRS_CB.retry_count=0;
            }
            break;
        }        

