moiify/M26-DTU/stm32f030x8/projects/stm32f10x_std/Source/FML/gprs/gprs_process.c
//        case GPRSState_QISACK_Req:
//        {
//            uint8_t cmd_buf[20],cmd_len;
//            cmd_len = sprintf((char *)cmd_buf, "AT+QISACK=%d\r\n", s_GPRS_CB.CurQISACKSocketNumber);
//            BSP_USART_WriteBytes(BSP_USART_GPRS,cmd_buf,cmd_len);
//            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
//            s_GPRS_CB.state = GPRSState_QISACK_Resp;
//            s_GPRS_CB.retry_count++;
//            DEBUG("[GPRS] CMD:QISACK(%d)\r\n", s_GPRS_CB.CurQISACKSocketNumber);
//            break;
//        }
//        case GPRSState_QISACK_Resp:
//        {
//            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
//            {
//                DEBUG("[GPRS] CMD QISACK timeout\r\n");
//                s_GPRS_CB.state = GPRSState_Idle;
//                s_GPRS_CB.retry_count=0;
//
//                s_GPRSSocketList.Socket[s_GPRS_CB.CurQISACKSocketNumber].Statistics.SendNoAckCount++;
//
//                if (s_GPRSSocketList.Socket[s_GPRS_CB.CurQISACKSocketNumber].Statistics.SendNoAckCount >= GPRS_SENT_NOACK_COUT_MAX)
//                {
//                    s_GPRSSocketList.Socket[s_GPRS_CB.CurQISACKSocketNumber].Statistics.SendNoAckCount = 0;
//                    gprs_add_at_closecmd(s_GPRS_CB.CurQISACKSocketNumber);
//                }
//            }
//            break;
//        }
        case GPRSState_Idle:
        {
            gprs_idle_process();
            break;
        }
        default:
        {
            break;
        }
    }
}
void GPRS_ACK_Process(void)
{   
    uint8_t muxnum;
    if(g_AT_ReceiveBuf.Count>0)
    {   
        if( strstr((char *)g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf,"CLOSED")!=NULL)
        {
//            if(g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf[2]=='0')
//            {   
//                s_GPRS_CB.Socket_Info_t[0].LinkState=GPRSLinkState_Lost;
//                INFO("[GPRS] Socket0 Close!\r\n");
//            }
//            else if(g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf[2]=='1')               
//            {   
//                s_GPRS_CB.Socket_Info_t[1].LinkState=GPRSLinkState_Lost;
//                INFO("[GPRS] Socket1 Close!\r\n");
//            }
            muxnum=g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf[2]-48;
            s_GPRS_CB.Socket_Info_t[muxnum].LinkState=GPRSLinkState_Lost;
            INFO("[GPRS] Socket Close!\r\n"); 
            g_AT_ReceiveBuf.Count--;
            g_AT_ReceiveBuf.Out++;
            g_AT_ReceiveBuf.Out %=sizeof (g_AT_ReceiveBuf.Buf)/sizeof(g_AT_ReceiveBuf.Buf[0]);
        }
        else if( strstr((char *)g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf,"RECEIVE")!=NULL)
        {  
            Gprs_GetSocketAndLength();
            Server_receiveDataInfo.In++;
            Server_receiveDataInfo.Count++;
            Server_receiveDataInfo.In %=Server_receiveDataInfo.Size;
            g_AT_ReceiveBuf.Count--;
            g_AT_ReceiveBuf.Out++;
            g_AT_ReceiveBuf.Out %=sizeof (g_AT_ReceiveBuf.Buf)/sizeof(g_AT_ReceiveBuf.Buf[0]);
        }
        else
        {
            gprs_check_process();
            g_AT_ReceiveBuf.Count--;
            g_AT_ReceiveBuf.Out++;
            g_AT_ReceiveBuf.Out %=g_AT_ReceiveBuf.Size;
        }
    }
}
void Gprs_Add_Sockets(Socket_Connectway connectway,uint8_t * address,uint32_t port)  //添加Sokcet的接口
{  
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Socket_En=1;
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Conncet_way=connectway;
    if(s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Conncet_way==0)
    {
        sprintf((char *)s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].IP_Address,(const char *)address);
    }
    else 
    {
        sprintf((char *)s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Domain,(const char *)address);
    }
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Server_port=port;
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Mux=s_GPRS_CB.scoket_count;
    s_GPRS_CB.scoket_count++;
}
void Gprs_UpdateRssi()   //更新信号强度
{   
    if(g_SystemInfo.Gprs_Init_Status==Gprs_Init_Complete)
    {
        s_GPRS_CB.rssi_count++;
    }
}